BitNibble/STM32G473VET6/STM32G473VET6_1/lib/src/usart_irq.c
/******************************************************************************
	usart_irq.c
Author:   <sergio.salazar.santos@gmail.com>
License:  GNU General Public License
Hardware: STM32GXXX
*******************************************************************************/
#include "usart_irq.h"
#include "stm32x_irq.h"
#include <stm32g4xx.h>
/******************************************************************************
 * USART1
 ******************************************************************************/
void usart1_pe_callback(void)   {}
void usart1_fe_callback(void)   {}
void usart1_ne_callback(void)   {}
void usart1_ore_callback(void)  {}

void usart1_idle_callback(void) {}
void usart1_rxne_callback(void) {}
void usart1_txe_callback(void)  {}
void usart1_tc_callback(void)   {}

void usart1_cts_callback(void)  {}
void usart1_rtof_callback(void) {}
void usart1_eob_callback(void)  {}
void usart1_cmf_callback(void)  {}
void usart1_wuf_callback(void)  {}

void usart1_txfe_callback(void) {}
void usart1_rxff_callback(void) {}

/******************************************************************************
 * USART2
 ******************************************************************************/
void usart2_pe_callback(void)   {}
void usart2_fe_callback(void)   {}
void usart2_ne_callback(void)   {}
void usart2_ore_callback(void)  {}

void usart2_idle_callback(void) {}
void usart2_rxne_callback(void) {}
void usart2_txe_callback(void)  {}
void usart2_tc_callback(void)   {}

void usart2_cts_callback(void)  {}
void usart2_rtof_callback(void) {}
void usart2_eob_callback(void)  {}
void usart2_cmf_callback(void)  {}
void usart2_wuf_callback(void)  {}

void usart2_txfe_callback(void) {}
void usart2_rxff_callback(void) {}

/******************************************************************************
 * USART3
 ******************************************************************************/
void usart3_pe_callback(void)   {}
void usart3_fe_callback(void)   {}
void usart3_ne_callback(void)   {}
void usart3_ore_callback(void)  {}

void usart3_idle_callback(void) {}
void usart3_rxne_callback(void) {}
void usart3_txe_callback(void)  {}
void usart3_tc_callback(void)   {}

void usart3_cts_callback(void)  {}
void usart3_rtof_callback(void) {}
void usart3_eob_callback(void)  {}
void usart3_cmf_callback(void)  {}
void usart3_wuf_callback(void)  {}

void usart3_txfe_callback(void) {}
void usart3_rxff_callback(void) {}

/******************************************************************************
 * UART4
 ******************************************************************************/
void uart4_pe_callback(void)    {}
void uart4_fe_callback(void)    {}
void uart4_ne_callback(void)    {}
void uart4_ore_callback(void)   {}

void uart4_idle_callback(void)  {}
void uart4_rxne_callback(void)  {}
void uart4_txe_callback(void)   {}
void uart4_tc_callback(void)    {}

void uart4_cts_callback(void)   {}
void uart4_rtof_callback(void)  {}
void uart4_eob_callback(void)   {}
void uart4_cmf_callback(void)   {}
void uart4_wuf_callback(void)   {}

void uart4_txfe_callback(void)  {}
void uart4_rxff_callback(void)  {}

/******************************************************************************
 * UART5
 ******************************************************************************/
void uart5_pe_callback(void)    {}
void uart5_fe_callback(void)    {}
void uart5_ne_callback(void)    {}
void uart5_ore_callback(void)   {}

void uart5_idle_callback(void)  {}
void uart5_rxne_callback(void)  {}
void uart5_txe_callback(void)   {}
void uart5_tc_callback(void)    {}

void uart5_cts_callback(void)   {}
void uart5_rtof_callback(void)  {}
void uart5_eob_callback(void)   {}
void uart5_cmf_callback(void)   {}
void uart5_wuf_callback(void)   {}

void uart5_txfe_callback(void)  {}
void uart5_rxff_callback(void)  {}

/******************************************************************************
 * LPUART1
 ******************************************************************************/
void lpuart1_pe_callback(void)   {}
void lpuart1_fe_callback(void)   {}
void lpuart1_ne_callback(void)   {}
void lpuart1_ore_callback(void)  {}

void lpuart1_idle_callback(void) {}
void lpuart1_rxne_callback(void) {}
void lpuart1_txe_callback(void)  {}
void lpuart1_tc_callback(void)   {}

void lpuart1_cts_callback(void)  {}
void lpuart1_rtof_callback(void) {}
void lpuart1_eob_callback(void)  {}
void lpuart1_cmf_callback(void)  {}
void lpuart1_wuf_callback(void)  {}

void lpuart1_txfe_callback(void) {}
void lpuart1_rxff_callback(void) {}

void USART1_IRQHandler(void)
{
    uint32_t isr = USART1->ISR;

    /****************************************************************
     * Parity Error
     ****************************************************************/
    if (isr & USART_ISR_PE)
    {
        USART1->ICR = USART_ICR_PECF;
        (void)USART1->ISR;

        if (irq()->uart->usart1->pe != NULL)
        {
            irq()->uart->usart1->pe();
        }
        else
        {
            usart1_pe_callback();
        }
    }

    /****************************************************************
     * Framing Error
     ****************************************************************/
    if (isr & USART_ISR_FE)
    {
        USART1->ICR = USART_ICR_FECF;
        (void)USART1->ISR;

        if (irq()->uart->usart1->fe != NULL)
        {
            irq()->uart->usart1->fe();
        }
        else
        {
            usart1_fe_callback();
        }
    }

    /****************************************************************
     * Noise Error
     ****************************************************************/
    if (isr & USART_ISR_NE)
    {
        USART1->ICR = USART_ICR_NECF;
        (void)USART1->ISR;

        if (irq()->uart->usart1->ne != NULL)
        {
            irq()->uart->usart1->ne();
        }
        else
        {
            usart1_ne_callback();
        }
    }

    /****************************************************************
     * Overrun Error
     ****************************************************************/
    if (isr & USART_ISR_ORE)
    {
        USART1->ICR = USART_ICR_ORECF;
        (void)USART1->ISR;

