BitNibble/STM32G473VET6/STM32G473VET6_1/lib/src/usart_irq.c
        if (irq()->uart->usart1->ore != NULL)
        {
            irq()->uart->usart1->ore();
        }
        else
        {
            usart1_ore_callback();
        }
    }

    /****************************************************************
     * Idle Line
     ****************************************************************/
    if (isr & USART_ISR_IDLE)
    {
        USART1->ICR = USART_ICR_IDLECF;
        (void)USART1->ISR;

        if (irq()->uart->usart1->idle != NULL)
        {
            irq()->uart->usart1->idle();
        }
        else
        {
            usart1_idle_callback();
        }
    }

    /****************************************************************
     * RX Not Empty
     ****************************************************************/
    if (isr & USART_ISR_RXNE_RXFNE)
    {
        if (irq()->uart->usart1->rxne != NULL)
        {
            irq()->uart->usart1->rxne();
        }
        else
        {
            usart1_rxne_callback();
        }
    }

    /****************************************************************
     * TX Empty
     ****************************************************************/
    if (isr & USART_ISR_TXE_TXFNF)
    {
        if (irq()->uart->usart1->txe != NULL)
        {
            irq()->uart->usart1->txe();
        }
        else
        {
            usart1_txe_callback();
        }
    }

    /****************************************************************
     * Transmission Complete
     ****************************************************************/
    if (isr & USART_ISR_TC)
    {
        USART1->ICR = USART_ICR_TCCF;
        (void)USART1->ISR;

        if (irq()->uart->usart1->tc != NULL)
        {
            irq()->uart->usart1->tc();
        }
        else
        {
            usart1_tc_callback();
        }
    }

    /****************************************************************
     * CTS
     ****************************************************************/
    if (isr & USART_ISR_CTSIF)
    {
        USART1->ICR = USART_ICR_CTSCF;
        (void)USART1->ISR;

        if (irq()->uart->usart1->cts != NULL)
        {
            irq()->uart->usart1->cts();
        }
        else
        {
            usart1_cts_callback();
        }
    }

    /****************************************************************
     * Receiver Timeout
     ****************************************************************/
    if (isr & USART_ISR_RTOF)
    {
        USART1->ICR = USART_ICR_RTOCF;
        (void)USART1->ISR;

        if (irq()->uart->usart1->rtof != NULL)
        {
            irq()->uart->usart1->rtof();
        }
        else
        {
            usart1_rtof_callback();
        }
    }

    /****************************************************************
     * End Of Block
     ****************************************************************/
    if (isr & USART_ISR_EOBF)
    {
        USART1->ICR = USART_ICR_EOBCF;
        (void)USART1->ISR;

        if (irq()->uart->usart1->eob != NULL)
        {
            irq()->uart->usart1->eob();
        }
        else
        {
            usart1_eob_callback();
        }
    }

    /****************************************************************
     * Character Match
     ****************************************************************/
    if (isr & USART_ISR_CMF)
    {
        USART1->ICR = USART_ICR_CMCF;
        (void)USART1->ISR;

        if (irq()->uart->usart1->cmf != NULL)
        {
            irq()->uart->usart1->cmf();
        }
        else
        {
            usart1_cmf_callback();
        }
    }

    /****************************************************************
     * Wakeup From Stop
     ****************************************************************/
    if (isr & USART_ISR_WUF)
    {
        USART1->ICR = USART_ICR_WUCF;
        (void)USART1->ISR;

        if (irq()->uart->usart1->wuf != NULL)
        {
            irq()->uart->usart1->wuf();
        }
        else
        {
            usart1_wuf_callback();
        }
    }

    /****************************************************************
     * TX FIFO Empty
     ****************************************************************/
    if (isr & USART_ISR_TXFE)
    {
        if (irq()->uart->usart1->txfe != NULL)
        {
            irq()->uart->usart1->txfe();
        }
        else
        {
            usart1_txfe_callback();
        }
    }

    /****************************************************************
     * RX FIFO Full
     ****************************************************************/
    if (isr & USART_ISR_RXFF)
    {
        if (irq()->uart->usart1->rxff != NULL)
        {
            irq()->uart->usart1->rxff();
        }
        else
        {
            usart1_rxff_callback();
        }
    }
}

void USART2_IRQHandler(void)
{
    uint32_t isr = USART2->ISR;

    /* Parity Error */
    if (isr & USART_ISR_PE)
    {
        USART2->ICR = USART_ICR_PECF;
        (void)USART2->ICR;

        if (irq()->uart->usart2->parity_error != NULL)
        {
            irq()->uart->usart2->parity_error();
        }
        else
        {
            usart2_pe_callback();
        }
    }

    /* Framing Error */
    if (isr & USART_ISR_FE)
    {
        USART2->ICR = USART_ICR_FECF;
        (void)USART2->ICR;

        if (irq()->uart->usart2->framing_error != NULL)
        {
            irq()->uart->usart2->framing_error();
        }
        else
        {
            usart2_fe_callback();
        }
    }

    /* Noise Error */
    if (isr & USART_ISR_NE)
    {
        USART2->ICR = USART_ICR_NECF;
        (void)USART2->ICR;

        if (irq()->uart->usart2->noise_error != NULL)
        {
            irq()->uart->usart2->noise_error();
        }
        else
        {
            usart2_ne_callback();
        }
    }

    /* Overrun Error */
    if (isr & USART_ISR_ORE)
    {
        USART2->ICR = USART_ICR_ORECF;
        (void)USART2->ICR;

        if (irq()->uart->usart2->overrun_error != NULL)
        {
            irq()->uart->usart2->overrun_error();
        }
        else
        {
            usart2_ore_callback();
        }
    }

    /* Idle Line */
    if (isr & USART_ISR_IDLE)
    {
        USART2->ICR = USART_ICR_IDLECF;
        (void)USART2->ICR;

        if (irq()->uart->usart2->idle != NULL)
        {
            irq()->uart->usart2->idle();
        }
        else
        {
            usart2_idle_callback();
        }
    }

    /* RX Not Empty */
    if (isr & USART_ISR_RXNE_RXFNE)
    {
        if (irq()->uart->usart2->rxne != NULL)
        {
            irq()->uart->usart2->rxne();
        }
        else
        {
            usart2_rxne_callback();
        }
    }

    /* Transmission Complete */
    if (isr & USART_ISR_TC)
    {
        USART2->ICR = USART_ICR_TCCF;
        (void)USART2->ICR;

        if (irq()->uart->usart2->tc != NULL)
        {
            irq()->uart->usart2->tc();
        }
        else
        {
            usart2_tc_callback();
        }
    }

    /* TX Empty */
    if (isr & USART_ISR_TXE_TXFNF)
    {
        if (irq()->uart->usart2->txe != NULL)
        {
            irq()->uart->usart2->txe();
        }
        else
        {
            usart2_txe_callback();
        }
    }

    /* CTS */
    if (isr & USART_ISR_CTSIF)
    {
        USART2->ICR = USART_ICR_CTSCF;
        (void)USART2->ICR;

