BitNibble/STM32G473VET6/STM32G473VET6_1/lib/src/usart_irq.c
        if (irq()->uart->usart2->cts != NULL)
        {
            irq()->uart->usart2->cts();
        }
        else
        {
            usart2_cts_callback();
        }
    }

    /* Receiver Timeout */
    if (isr & USART_ISR_RTOF)
    {
        USART2->ICR = USART_ICR_RTOCF;
        (void)USART2->ICR;

        if (irq()->uart->usart2->receiver_timeout != NULL)
        {
            irq()->uart->usart2->receiver_timeout();
        }
        else
        {
            usart2_rtof_callback();
        }
    }

    /* End Of Block */
    if (isr & USART_ISR_EOBF)
    {
        USART2->ICR = USART_ICR_EOBCF;
        (void)USART2->ICR;

        if (irq()->uart->usart2->end_of_block != NULL)
        {
            irq()->uart->usart2->end_of_block();
        }
        else
        {
            usart2_eob_callback();
        }
    }

    /* Wake Up */
    if (isr & USART_ISR_WUF)
    {
        USART2->ICR = USART_ICR_WUCF;
        (void)USART2->ICR;

        if (irq()->uart->usart2->wake_up != NULL)
        {
            irq()->uart->usart2->wake_up();
        }
        else
        {
            usart2_wuf_callback();
        }
    }
}

void USART3_IRQHandler(void)
{
    uint32_t isr = USART3->ISR;

    /* Parity Error */
    if (isr & USART_ISR_PE)
    {
        USART3->ICR = USART_ICR_PECF;
        (void)USART3->ICR;

        if (irq()->uart->usart3->parity_error != NULL)
        {
            irq()->uart->usart3->parity_error();
        }
        else
        {
            usart3_pe_callback();
        }
    }

    /* Framing Error */
    if (isr & USART_ISR_FE)
    {
        USART3->ICR = USART_ICR_FECF;
        (void)USART3->ICR;

        if (irq()->uart->usart3->framing_error != NULL)
        {
            irq()->uart->usart3->framing_error();
        }
        else
        {
            usart3_fe_callback();
        }
    }

    /* Noise Error */
    if (isr & USART_ISR_NE)
    {
        USART3->ICR = USART_ICR_NECF;
        (void)USART3->ICR;

        if (irq()->uart->usart3->noise_error != NULL)
        {
            irq()->uart->usart3->noise_error();
        }
        else
        {
            usart3_ne_callback();
        }
    }

    /* Overrun Error */
    if (isr & USART_ISR_ORE)
    {
        USART3->ICR = USART_ICR_ORECF;
        (void)USART3->ICR;

        if (irq()->uart->usart3->overrun_error != NULL)
        {
            irq()->uart->usart3->overrun_error();
        }
        else
        {
            usart3_ore_callback();
        }
    }

    /* Idle Line */
    if (isr & USART_ISR_IDLE)
    {
        USART3->ICR = USART_ICR_IDLECF;
        (void)USART3->ICR;

        if (irq()->uart->usart3->idle != NULL)
        {
            irq()->uart->usart3->idle();
        }
        else
        {
            usart3_idle_callback();
        }
    }

    /* RX Not Empty */
    if (isr & USART_ISR_RXNE_RXFNE)
    {
        if (irq()->uart->usart3->rxne != NULL)
        {
            irq()->uart->usart3->rxne();
        }
        else
        {
            usart3_rxne_callback();
        }
    }

    /* Transmission Complete */
    if (isr & USART_ISR_TC)
    {
        USART3->ICR = USART_ICR_TCCF;
        (void)USART3->ICR;

        if (irq()->uart->usart3->tc != NULL)
        {
            irq()->uart->usart3->tc();
        }
        else
        {
            usart3_tc_callback();
        }
    }

    /* TX Empty */
    if (isr & USART_ISR_TXE_TXFNF)
    {
        if (irq()->uart->usart3->txe != NULL)
        {
            irq()->uart->usart3->txe();
        }
        else
        {
            usart3_txe_callback();
        }
    }

    /* CTS */
    if (isr & USART_ISR_CTSIF)
    {
        USART3->ICR = USART_ICR_CTSCF;
        (void)USART3->ICR;

        if (irq()->uart->usart3->cts != NULL)
        {
            irq()->uart->usart3->cts();
        }
        else
        {
            usart3_cts_callback();
        }
    }

    /* Receiver Timeout */
    if (isr & USART_ISR_RTOF)
    {
        USART3->ICR = USART_ICR_RTOCF;
        (void)USART3->ICR;

        if (irq()->uart->usart3->receiver_timeout != NULL)
        {
            irq()->uart->usart3->receiver_timeout();
        }
        else
        {
            usart3_rtof_callback();
        }
    }

    /* End Of Block */
    if (isr & USART_ISR_EOBF)
    {
        USART3->ICR = USART_ICR_EOBCF;
        (void)USART3->ICR;

        if (irq()->uart->usart3->end_of_block != NULL)
        {
            irq()->uart->usart3->end_of_block();
        }
        else
        {
            usart3_eob_callback();
        }
    }

    /* Wake Up */
    if (isr & USART_ISR_WUF)
    {
        USART3->ICR = USART_ICR_WUCF;
        (void)USART3->ICR;

        if (irq()->uart->usart3->wake_up != NULL)
        {
            irq()->uart->usart3->wake_up();
        }
        else
        {
            usart3_wuf_callback();
        }
    }
}

void UART4_IRQHandler(void)
{
    uint32_t isr = UART4->ISR;

    /* Parity Error */
    if (isr & USART_ISR_PE)
    {
        UART4->ICR = USART_ICR_PECF;

        if (irq()->uart->uart4->parity_error != NULL)
        {
            irq()->uart->uart4->parity_error();
        }
        else
        {
            uart4_pe_callback();
        }
    }

    /* Framing Error */
    if (isr & USART_ISR_FE)
    {
        UART4->ICR = USART_ICR_FECF;

        if (irq()->uart->uart4->framing_error != NULL)
        {
            irq()->uart->uart4->framing_error();
        }
        else
        {
            uart4_fe_callback();
        }
    }

    /* Noise Error */
    if (isr & USART_ISR_NE)
    {
        UART4->ICR = USART_ICR_NECF;

        if (irq()->uart->uart4->noise_error != NULL)
        {
            irq()->uart->uart4->noise_error();
        }
        else
        {
            uart4_ne_callback();
        }
    }

    /* Overrun Error */
    if (isr & USART_ISR_ORE)
    {
        UART4->ICR = USART_ICR_ORECF;

        if (irq()->uart->uart4->overrun_error != NULL)
        {
            irq()->uart->uart4->overrun_error();
        }
        else
        {
            uart4_ore_callback();
        }
    }

    /* Idle Line */
    if (isr & USART_ISR_IDLE)
    {
        UART4->ICR = USART_ICR_IDLECF;

        if (irq()->uart->uart4->idle != NULL)
        {
            irq()->uart->uart4->idle();
        }
        else
        {
            uart4_idle_callback();
        }
    }

    /* RX Not Empty */
    if (isr & USART_ISR_RXNE_RXFNE)
    {
        if (irq()->uart->uart4->rxne != NULL)
        {
            irq()->uart->uart4->rxne();
        }
        else
        {
            uart4_rxne_callback();
        }
    }

    /* TX Empty */
    if (isr & USART_ISR_TXE_TXFNF)
    {
        if (irq()->uart->uart4->txe != NULL)
        {
            irq()->uart->uart4->txe();
        }
        else
        {
            uart4_txe_callback();
        }
    }

    /* Transmission Complete */
    if (isr & USART_ISR_TC)
    {
        UART4->ICR = USART_ICR_TCCF;

