BitNibble/STM32G473VET6/STM32G473VET6_1/lib/src/usart_irq.c
        if (irq()->uart->uart4->tc != NULL)
        {
            irq()->uart->uart4->tc();
        }
        else
        {
            uart4_tc_callback();
        }
    }

    /* Character Match */
    if (isr & USART_ISR_CMF)
    {
        UART4->ICR = USART_ICR_CMCF;

        if (irq()->uart->uart4->character_match != NULL)
        {
            irq()->uart->uart4->character_match();
        }
        else
        {
            uart4_cmf_callback();
        }
    }

    /* Receiver Timeout */
    if (isr & USART_ISR_RTOF)
    {
        UART4->ICR = USART_ICR_RTOCF;

        if (irq()->uart->uart4->receiver_timeout != NULL)
        {
            irq()->uart->uart4->receiver_timeout();
        }
        else
        {
            uart4_rtof_callback();
        }
    }

    /* End Of Block */
    if (isr & USART_ISR_EOBF)
    {
        UART4->ICR = USART_ICR_EOBCF;

        if (irq()->uart->uart4->end_of_block != NULL)
        {
            irq()->uart->uart4->end_of_block();
        }
        else
        {
            uart4_eob_callback();
        }
    }

    /* CTS */
    if (isr & USART_ISR_CTSIF)
    {
        UART4->ICR = USART_ICR_CTSCF;

        if (irq()->uart->uart4->cts != NULL)
        {
            irq()->uart->uart4->cts();
        }
        else
        {
            uart4_cts_callback();
        }
    }

    /* Wakeup from Stop */
    if (isr & USART_ISR_WUF)
    {
        UART4->ICR = USART_ICR_WUCF;

        if (irq()->uart->uart4->wakeup != NULL)
        {
            irq()->uart->uart4->wakeup();
        }
        else
        {
            uart4_wuf_callback();
        }
    }
}

void UART5_IRQHandler(void)
{
    uint32_t isr = UART5->ISR;

    // Parity Error
    if (isr & USART_ISR_PE)
    {
        UART5->ICR = USART_ICR_PECF;

        if (irq()->uart->uart5->parity_error != NULL)
        {
            irq()->uart->uart5->parity_error();
        }
        else
        {
            uart5_pe_callback();
        }
    }

    // Framing Error
    if (isr & USART_ISR_FE)
    {
        UART5->ICR = USART_ICR_FECF;

        if (irq()->uart->uart5->framing_error != NULL)
        {
            irq()->uart->uart5->framing_error();
        }
        else
        {
            uart5_fe_callback();
        }
    }

    // Noise Error
    if (isr & USART_ISR_NE)
    {
        UART5->ICR = USART_ICR_NECF;

        if (irq()->uart->uart5->noise_error != NULL)
        {
            irq()->uart->uart5->noise_error();
        }
        else
        {
            uart5_ne_callback();
        }
    }

    // Overrun Error
    if (isr & USART_ISR_ORE)
    {
        UART5->ICR = USART_ICR_ORECF;

        if (irq()->uart->uart5->overrun_error != NULL)
        {
            irq()->uart->uart5->overrun_error();
        }
        else
        {
            uart5_ore_callback();
        }
    }

    // Idle Line
    if (isr & USART_ISR_IDLE)
    {
        UART5->ICR = USART_ICR_IDLECF;

        if (irq()->uart->uart5->idle != NULL)
        {
            irq()->uart->uart5->idle();
        }
        else
        {
            uart5_idle_callback();
        }
    }

    // RX Not Empty
    if (isr & USART_ISR_RXNE_RXFNE)
    {
        if (irq()->uart->uart5->rxne != NULL)
        {
            irq()->uart->uart5->rxne();
        }
        else
        {
            uart5_rxne_callback();
        }
    }

    // TX Empty
    if (isr & USART_ISR_TXE_TXFNF)
    {
        if (irq()->uart->uart5->txe != NULL)
        {
            irq()->uart->uart5->txe();
        }
        else
        {
            uart5_txe_callback();
        }
    }

    // Transmission Complete
    if (isr & USART_ISR_TC)
    {
        UART5->ICR = USART_ICR_TCCF;

        if (irq()->uart->uart5->tc != NULL)
        {
            irq()->uart->uart5->tc();
        }
        else
        {
            uart5_tc_callback();
        }
    }

    // Character Match
    if (isr & USART_ISR_CMF)
    {
        UART5->ICR = USART_ICR_CMCF;

        if (irq()->uart->uart5->character_match != NULL)
        {
            irq()->uart->uart5->character_match();
        }
        else
        {
            uart5_cmf_callback();
        }
    }

    // Receiver Timeout
    if (isr & USART_ISR_RTOF)
    {
        UART5->ICR = USART_ICR_RTOCF;

        if (irq()->uart->uart5->receiver_timeout != NULL)
        {
            irq()->uart->uart5->receiver_timeout();
        }
        else
        {
            uart5_rtof_callback();
        }
    }

    // End Of Block
    if (isr & USART_ISR_EOBF)
    {
        UART5->ICR = USART_ICR_EOBCF;

        if (irq()->uart->uart5->end_of_block != NULL)
        {
            irq()->uart->uart5->end_of_block();
        }
        else
        {
            uart5_eob_callback();
        }
    }

    // CTS
    if (isr & USART_ISR_CTSIF)
    {
        UART5->ICR = USART_ICR_CTSCF;

        if (irq()->uart->uart5->cts != NULL)
        {
            irq()->uart->uart5->cts();
        }
        else
        {
            uart5_cts_callback();
        }
    }

    // Wakeup from Stop
    if (isr & USART_ISR_WUF)
    {
        UART5->ICR = USART_ICR_WUCF;

        if (irq()->uart->uart5->wakeup != NULL)
        {
            irq()->uart->uart5->wakeup();
        }
        else
        {
            uart5_wuf_callback();
        }
    }
}

void LPUART1_IRQHandler(void)
{
    uint32_t isr = LPUART1->ISR;

    // Parity Error
    if (isr & USART_ISR_PE)
    {
        LPUART1->ICR = USART_ICR_PECF;

        if (irq()->uart->lpuart1->parity_error != NULL)
        {
            irq()->uart->lpuart1->parity_error();
        }
        else
        {
            lpuart1_pe_callback();
        }
    }

    // Framing Error
    if (isr & USART_ISR_FE)
    {
        LPUART1->ICR = USART_ICR_FECF;

        if (irq()->uart->lpuart1->framing_error != NULL)
        {
            irq()->uart->lpuart1->framing_error();
        }
        else
        {
            lpuart1_fe_callback();
        }
    }

    // Noise Error
    if (isr & USART_ISR_NE)
    {
        LPUART1->ICR = USART_ICR_NECF;

        if (irq()->uart->lpuart1->noise_error != NULL)
        {
            irq()->uart->lpuart1->noise_error();
        }
        else
        {
            lpuart1_ne_callback();
        }
    }

    // Overrun Error
    if (isr & USART_ISR_ORE)
    {
        LPUART1->ICR = USART_ICR_ORECF;

